import json

import pandas as pd
import pytest

TEST_DATA = {
    "Описание": [
        "Покупка в магазине",
        "Оплата услуг",
        "Магазин одежды",
        "Перевод между счетами",
        "Перевод другу",
    ],
    "Категория": ["Супермаркет", "Интернет", "Шоппинг", "Переводы", "Другое"],
    "Сумма": [-1000, -500, -2000, 3000, -500],
}


@pytest.fixture
def test_transactions_df():
    data = {
        "Категория": ["Супермаркеты", "Аптека", "Супермаркеты"],
        "Дата операции": [
            "01.03.2022 10:00:00",
            "15.12.2021 12:00:00",
            "01.03.2022 08:00:00",
        ],
        "Сумма операции": [-1500, -500, -2000],
    }
    return pd.DataFrame(data)


@pytest.fixture
def mock_excel_data():
    return pd.DataFrame(TEST_DATA)


@pytest.fixture
def mock_path():
    return "fake/path/to/excel.xlsx"


@pytest.fixture
def mock_settings_file(tmp_path):
    data = {"user_currencies": ["USD", "EUR"], "user_stocks": ["AAPL", "TSLA"]}
    file = tmp_path / "settings.json"
    file.write_text(json.dumps(data), encoding="utf-8")
    return file


@pytest.fixture
def mock_excel_data_params():
    return pd.DataFrame(
        {
            "Дата операции": ["2023-01-05", "2023-01-15", "2023-02-01"],
            "Номер карты": ["1234567890123456", "6543210987654321", "1234567890123456"],
            "Сумма операции": [-1000, 500, -2000],
            "Кэшбэк": [10, 0, 20],
            "Сумма операции с округлением": [-1000, 500, -2000],
            "Дата платежа": ["2023-01-05", "2023-01-15", "2023-02-01"],
            "Категория": ["Еда", "Перевод", "Транспорт"],
            "Описание": ["Покупка", "Возврат", "Такси"],
        }
    )


@pytest.fixture
def mock_transactions_df():
    return pd.DataFrame(
        {
            "Дата операции": ["01.01.2023 12:00:00", "15.01.2023 14:30:00"],
            "Номер карты": ["123456******3456", "654321******4321"],
            "Сумма операции": [-1500, -2000],
            "Кэшбэк": [15, 20],
            "Сумма операции с округлением": [-1500, -2000],
            "Дата платежа": ["01.01.2023", "15.01.2023"],
            "Категория": ["Еда", "Транспорт"],
            "Описание": ["Супермаркет", "Такси"],
        }
    )


@pytest.fixture
def test_transactions():
    df = pd.DataFrame(
        {
            "Категория": ["Супермаркеты", "Супермаркеты", "Супермаркеты"],
            "Дата операции": pd.to_datetime(
                [
                    "2022-03-15 10:00:00",  # Входит в период 2022-02-01 — 2022-05-01
                    "2022-04-20 12:00:00",  # Входит
                    "2022-05-01 08:00:00",  # Входит (ровно end_date)
                ]
            ),
            "Сумма операции": [-1500, -2000, -3000],
        }
    )
    return df
